# Analisis de Datos con Python - Clase 7

[Material Complementario](https://1drv.ms/f/s!Anh5cvrOJtUTlPZv1CMNoOt7txeprQ?e=ggipgG)

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('titanic.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Modulo 4.- Pandas 5

## 5.1. Estadisticas
Pandas provee numerosos métodos para realizar estadísticas  sobre los datos tanto en series como en dataframes. Por defecto,  estos métodos ignoran los missing values, no teniéndolos en  cuenta a la hora de realizar los cálculos. Si se usa el parámetro  skipna = False los valores NaN se propagan al resultado ﬁnal.
Cuando se trabaja con un dataframe, estas funciones se calculan  por columna y sólo las que tienen números y devuelven una serie.

Entre estos métodos podemos encontrar: **sum, mean, std, var,  mode, median, count, min, max, prod**

In [3]:
data.mean()

C:\Users\luisj\AppData\Local\Temp\ipykernel_16236\4080730010.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [8]:
# promedio y desviacion standar de las edades
data['Age'].mean(), data['Age'].std()

(29.69911764705882, 14.526497332334044)

In [9]:
# promedio y desviacion standar de las edades redondeado a 1 decimal
print( 'El promedio de edad de los pasajeros era de ', round(data['Age'].mean(), 1), 'y la desviacion estandar de', round(data['Age'].std(), 1))

El promedio de edad de los pasajeros era de  29.7 y la desviacion estandar de 14.5

In [12]:
# promedio de edad de las mujeres de primera clase
round(data.loc[(data["Pclass"] == 1) & (data["Sex"] == 'female') , 'Age'].mean(),1)

34.6

In [13]:
# contar cantidad de varones
data.loc[data["Sex"] == 'male', "Sex"].count()

577

In [28]:
data[data["Sex"] == 'male']['Sex']

0      male
4      male
5      male
6      male
7      male
       ...
883    male
884    male
886    male
889    male
890    male
Name: Sex, Length: 577, dtype: object

In [25]:
data.loc[3, "Age"]

35.0

In [29]:
# cantidad de elementos unicos en cada columna
data.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

## 5.2. describe()
El método describe permite ver un resumen de las  estadísticas principales de cada columna.
Cuando la columna es **numérica** devuelve: cantidad de  elementos válidos, promedio, desviación standard,  mínimo, máximo y cuartiles.

Cuando la columna **no es numérica** devuelve: cantidad  de elementos válidos, cantidad de elementos únicos y el  elemento más frecuente y su frecuencia.

Cuando el dataframe incluye **columnas numéricas y no  numéricas**, el método sólo muestra el resumen de las  columnas numéricas. Este comportamiento se puede  controlar con los parámetros include/exclude.

In [30]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [32]:
data['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

## 5.3. aggregate()
El método aggregate (con el alias agg) permite hacer  un resumen con las funciones de agregación que  querramos. Se le puede pasar como argumentos un  string con el nombre de la función o la función en sí  (que puede incluir funciones de numpy).
En principio estas funciones se calculan sobre todas las  columnas, lo que puede causar resultados inesperados.  Por ejemplo, la función sum aplicada a strings, los  concatena todos. Se pueden seleccionar las columnas  numéricas con el método select_dtypes.

In [35]:
data.select_dtypes('number').aggregate(['sum', min, np.max, 'var'])

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
sum,397386.0,342.000000,2057.000000,21205.170000,466.000000,340.000000,28693.949300
min,1.0,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
max,891.0,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200
var,66231.0,0.236772,0.699015,211.019125,1.216043,0.649728,2469.436846

In [36]:
type(data.select_dtypes('number').aggregate(['sum', min, np.max, 'var']))

pandas.core.frame.DataFrame

## 5.4. value_counts()
El método value_counts para series permite encontrar  una distribución de frecuencias de los valores únicos que  contiene. Devuelve una serie cuyos índices son los valores  únicos de la serie original y sus valores son las respectivas  frecuencias.

El resultado está ordenado de mayor a menor, de modo  que el primer elemento es el más frecuente.
Se puede hacer que se ordene en orden ascendente con  el parámetro ascending.
El parámetro normalize permite obtener las proporciones  de cada valor.

In [37]:
s = pd.Series([1, 2, 1, 3, 5, 2, 1, 1, 4, 4, 1])
s.value_counts()

1    5
2    2
4    2
3    1
5    1
dtype: int64

In [38]:
s.value_counts(normalize = True, sort = False)

1    0.454545
2    0.181818
3    0.090909
5    0.090909
4    0.181818
dtype: float64

In [39]:
s.value_counts(normalize = True, sort = True)

1    0.454545
2    0.181818
4    0.181818
3    0.090909
5    0.090909
dtype: float64

In [42]:
data['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64